Agrileaf/MachineAutomation/STM32HardwareCode/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdbool.h"
#include "System_variables.h"
#include "Automatic_Mode.h"
#include "Manual_Mode.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */


/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

void Device_init(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define RMII_MDC_Pin GPIO_PIN_1
#define RMII_MDC_GPIO_Port GPIOC
#define RMII_REF_CLK_Pin GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port GPIOA
#define RMII_MDIO_Pin GPIO_PIN_2
#define RMII_MDIO_GPIO_Port GPIOA
#define RMII_CRS_DV_Pin GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port GPIOA
#define RMII_RXD0_Pin GPIO_PIN_4
#define RMII_RXD0_GPIO_Port GPIOC
#define RMII_RXD1_Pin GPIO_PIN_5
#define RMII_RXD1_GPIO_Port GPIOC
#define LD1_Pin GPIO_PIN_0
#define LD1_GPIO_Port GPIOB
#define EMERGENCY_STOP_Pin GPIO_PIN_13
#define EMERGENCY_STOP_GPIO_Port GPIOF
#define EMERGENCY_STOP_EXTI_IRQn EXTI15_10_IRQn
#define AUTOMATIC_MODE_Pin GPIO_PIN_14
#define AUTOMATIC_MODE_GPIO_Port GPIOF
#define AUTOMATIC_MODE_EXTI_IRQn EXTI15_10_IRQn
#define ALARM_Pin GPIO_PIN_0
#define ALARM_GPIO_Port GPIOG
#define MOTOR_1_Pin GPIO_PIN_7
#define MOTOR_1_GPIO_Port GPIOE
#define MOTOR_2_Pin GPIO_PIN_8
#define MOTOR_2_GPIO_Port GPIOE
#define PEDAL_A1_Pin GPIO_PIN_10
#define PEDAL_A1_GPIO_Port GPIOE
#define PEDAL_A2_Pin GPIO_PIN_11
#define PEDAL_A2_GPIO_Port GPIOE
#define PEDAL_B1_Pin GPIO_PIN_12
#define PEDAL_B1_GPIO_Port GPIOE
#define PEDAL_B2_Pin GPIO_PIN_13
#define PEDAL_B2_GPIO_Port GPIOE
#define PEDAL_C1_Pin GPIO_PIN_14
#define PEDAL_C1_GPIO_Port GPIOE
#define PEDAL_C2_Pin GPIO_PIN_15
#define PEDAL_C2_GPIO_Port GPIOE
#define RMII_TXD1_Pin GPIO_PIN_13
#define RMII_TXD1_GPIO_Port GPIOB
#define LD3_Pin GPIO_PIN_14
#define LD3_GPIO_Port GPIOB
#define STLK_RX_Pin GPIO_PIN_8
#define STLK_RX_GPIO_Port GPIOD
#define STLK_TX_Pin GPIO_PIN_9
#define STLK_TX_GPIO_Port GPIOD
#define PEDAL_F2_Pin GPIO_PIN_10
#define PEDAL_F2_GPIO_Port GPIOD
#define PEDAL_F1_Pin GPIO_PIN_11
#define PEDAL_F1_GPIO_Port GPIOD
#define PEDAL_E2_Pin GPIO_PIN_12
#define PEDAL_E2_GPIO_Port GPIOD
#define PEDAL_E1_Pin GPIO_PIN_13
#define PEDAL_E1_GPIO_Port GPIOD
#define PEDAL_D1_Pin GPIO_PIN_4
#define PEDAL_D1_GPIO_Port GPIOG
#define PEDAL_D2_Pin GPIO_PIN_5
#define PEDAL_D2_GPIO_Port GPIOG
#define USB_PowerSwitchOn_Pin GPIO_PIN_6
#define USB_PowerSwitchOn_GPIO_Port GPIOG
#define USB_OverCurrent_Pin GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port GPIOG
#define USB_SOF_Pin GPIO_PIN_8
#define USB_SOF_GPIO_Port GPIOA
#define USB_VBUS_Pin GPIO_PIN_9
#define USB_VBUS_GPIO_Port GPIOA
#define USB_ID_Pin GPIO_PIN_10
#define USB_ID_GPIO_Port GPIOA
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define CYLINDER_6R_Pin GPIO_PIN_10
#define CYLINDER_6R_GPIO_Port GPIOC
#define CYLINDER_6F_Pin GPIO_PIN_11
#define CYLINDER_6F_GPIO_Port GPIOC
#define CYLINDER_5R_Pin GPIO_PIN_12
#define CYLINDER_5R_GPIO_Port GPIOC
#define CYLINDER_5F_Pin GPIO_PIN_0
#define CYLINDER_5F_GPIO_Port GPIOD
#define CYLINDER_4R_Pin GPIO_PIN_1
#define CYLINDER_4R_GPIO_Port GPIOD
#define CYLINDER_4F_Pin GPIO_PIN_2
#define CYLINDER_4F_GPIO_Port GPIOD
#define CYLINDER_3R_Pin GPIO_PIN_3
#define CYLINDER_3R_GPIO_Port GPIOD
#define CYLINDER_3F_Pin GPIO_PIN_4
#define CYLINDER_3F_GPIO_Port GPIOD
#define CYLINDER_2R_Pin GPIO_PIN_5
#define CYLINDER_2R_GPIO_Port GPIOD
#define CYLINDER_2F_Pin GPIO_PIN_6
#define CYLINDER_2F_GPIO_Port GPIOD
#define CYLINDER_1R_Pin GPIO_PIN_7
#define CYLINDER_1R_GPIO_Port GPIOD
#define CYLINDER_1F_Pin GPIO_PIN_9
#define CYLINDER_1F_GPIO_Port GPIOG
#define RMII_TX_EN_Pin GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port GPIOG
#define RMII_TXD0_Pin GPIO_PIN_13
#define RMII_TXD0_GPIO_Port GPIOG
#define SW0_Pin GPIO_PIN_3
#define SW0_GPIO_Port GPIOB
#define LD2_Pin GPIO_PIN_7
#define LD2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
